Repository: dinhquydds/nanocucurmin
Catalog: tm/itiv1-level2.tmx
Source language: en_us
Languages: vi

source: Fig 9c Periosteal releasing incision performed with a curved #15 c blade.
vi: Hình 9c Periosteal releasing incision performed with a curved #15 c blade.

source: Fig 9d After the donor block was adjusted to fit to the recipient site, a bone screw was placed in it to simplify intraoral placement.
vi: Hình 9d After the donor block was adjusted to fit to the recipient site, a bone screw was placed in it to simplify intraoral placement.

source: Fig 9e Frontal view of the fixated block.
vi: Hình 9e Frontal view of the fixated block.

source: Fig 9f Cancellous bone collected during the preparation procedures was packed around the block before covering it with the membrane.
vi: Hình 9f Cancellous bone collected during the preparation procedures was packed around the block before covering it with the membrane.

source: Fig 9g Placement of a resorbable membrane.
vi: Hình 9g Placement of a resorbable membrane.

source: Fig 9h Occlusal view after suturing.
vi: Hình 9h Occlusal view after suturing.

source: Fig 9i A mid-crestal incision at site 22 performed with a straight #12 blade.
vi: Hình 9i A mid-crestal incision at site 22 performed with a straight #12 blade.

source: Fig 9j Elevation of the tissue and removal of any soft-tissue residue on the surface of the bone.
vi: Hình 9j Elevation of the tissue and removal of any soft-tissue residue on the surface of the bone.

source: Fig 9k Periosteal releasing incision performed with a curved #15 c blade.
vi: Hình 9k Periosteal releasing incision performed with a curved #15 c blade.

source: Fig 9l Occlusal view of the fixated block.
vi: Hình 9l Occlusal view of the fixated block.

source: Fig 9m Cancellous bone collected during the preparation procedures was packed around the block before covering it with the membrane.
vi: Hình 9m Cancellous bone collected during the preparation procedures was packed around the block before covering it with the membrane.

source: Fig 9n Placement of a resorbable membrane.
vi: Hình 9n Placement of a resorbable membrane.

source: Fig 9o Occlusal view after suturing.
vi: Hình 9o Occlusal view after suturing.

source: Fig 9p Frontal postoperative view.
vi: Hình 9p Frontal postoperative view.

source: Figs 11a, b Vestibular (a) and occlusal (b) views of the extraction site six weeks after the right central maxillary incisor had been removed.
vi: Hình 11a, b Vestibular (a) and occlusal (b) views of the extraction site six weeks after the right central maxillary incisor had been removed.

source: Figs 12a, b Eight weeks after the extraction of tooth 11, the soft-tissue situation at the site of implantation was considered adequate according to the preferred early placement/early loading protocol.
vi: Hình 12a, b Eight weeks after the extraction of tooth 11, the soft-tissue situation at the site of implantation was considered adequate according to the preferred early placement/early loading protocol.

source: Figs 12a, b Having reduced the cervical emergence profile of the prefabricated temporary component on its interproximal and labial aspects, the mesoabutment was connected directly to the implant with the integrated occlusal screw (a).
vi: Hình 12a, b Having reduced the cervical emergence profile of the prefabricated temporary component on its interproximal and labial aspects, the mesoabutment was connected directly to the implant with the integrated occlusal screw (a).

source: Figs 13a, b Necessary individual modifications were performed outside the oral cavity wherever possible, using the appropriate rotary instruments.
vi: Hình 13a, b Necessary individual modifications were performed outside the oral cavity wherever possible, using the appropriate rotary instruments.

source: Figs 14a, b The customized temporary mesoabutment was reattached to the implant, secured with its retention screw, and the occlusal features carefully verified (a) and then corrected intraorally using diamond burs (b).
vi: Hình 14a, b The customized temporary mesoabutment was reattached to the implant, secured with its retention screw, and the occlusal features carefully verified (a) and then corrected intraorally using diamond burs (b).

source: Figs 14a-c In-Ceram blank at site 21, frontal and incisal view, and final situation with all-ceramic crown on tooth 11 and all-ceramic implant-supported superstructure at site 21.
vi: Hình 14a-c In-Ceram blank at site 21, frontal and incisal view, and final situation with all-ceramic crown on tooth 11 and all-ceramic implant-supported superstructure at site 21.

source: Figs 15a, b A transparent silicone material was used to verify the space at disposition for the subsequent acrylic resin veneering of the customized temporary mesoabutment.
vi: Hình 15a, b A transparent silicone material was used to verify the space at disposition for the subsequent acrylic resin veneering of the customized temporary mesoabutment.

source: Figs 15a, b The mucosal arch was naturally curved, and the papillae were well shaped.
vi: Hình 15a, b The mucosal arch was naturally curved, and the papillae were well shaped.

source: Figs 16a, b Labial (a) and occlusal (b) views of site 11 immediately after placement of a Regular Neck (RN) Tapered Effect (TE) implant.
vi: Hình 16a, b Labial (a) and occlusal (b) views of site 11 immediately after placement of a Regular Neck (RN) Tapered Effect (TE) implant.

source: Figs 16a,b A NN impression cap was screw-tightened on the implant shoulder.
vi: Hình 16a,b A NN impression cap was screw-tightened on the implant shoulder.

source: Figs 17a, b An advantage of using a combination of a transparent silicone material and a light-polymerizing acrylic resin is that the key can be carefully loaded, the absence of air entrapments can be verified, and the subsequent intraoral positioning carried out without time constraints.
vi: Hình 17a, b An advantage of using a combination of a transparent silicone material and a light-polymerizing acrylic resin is that the key can be carefully loaded, the absence of air entrapments can be verified, and the subsequent intraoral positioning carried out without time constraints.

source: Figs 17a, b The final transocclusally screw-retained ceramo-metal crown ready for insertion.
vi: Hình 17a, b The final transocclusally screw-retained ceramo-metal crown ready for insertion.

source: Figs 18a, b The lateral close-up view of the finalized provisional implant restoration before and after its insertion, showing that a flat cervical emergence profile was established.
vi: Hình 18a, b The lateral close-up view of the finalized provisional implant restoration before and after its insertion, showing that a flat cervical emergence profile was established.

source: Figs 19 and 20 show the situation with the impression cap carefully screwed into place (hand-tight).
vi: Hình 19 and 20 show the situation with the impression cap carefully screwed into place (hand-tight).

source: Figs 19a, b Two months after insertion of the screw-retained implant provisional, the peri-implant soft tissue displayed healthy and stable features.
vi: Hình 19a, b Two months after insertion of the screw-retained implant provisional, the peri-implant soft tissue displayed healthy and stable features.

source: Figs 1a-c A punch graft transfers keratinized tissue from the palate to the alveolus.
vi: Hình 1a-c A punch graft transfers keratinized tissue from the palate to the alveolus.

source: Figs 20a, b Primary wound closure was achieved with incision of the periosteum at the basal level of the flap, compensating for the significant “over-build” of the labial aspect at the implant site.
vi: Hình 20a, b Primary wound closure was achieved with incision of the periosteum at the basal level of the flap, compensating for the significant “over-build” of the labial aspect at the implant site.

source: Figs 21a, b The two year follow-up showed stable and esthetically pleasing soft-tissue contours.
vi: Hình 21a, b The two year follow-up showed stable and esthetically pleasing soft-tissue contours.

source: Figs 21a-c Close-up views (a: palatal; b: occlusal) of the master cast documenting the optimal implant position in an orofacial and a mesiodistal direction.
vi: Hình 21a-c Close-up views (a: palatal; b: occlusal) of the master cast documenting the optimal implant position in an orofacial and a mesiodistal direction.

source: Figs 22a, b In the first step, the clinical crown body was established, composed of a complex sequence of layers of different opacities and shades aimed at imitating the basic components - dentin, enamel, and incisal translucency - of a natural central maxillary incisor (a).
vi: Hình 22a, b In the first step, the clinical crown body was established, composed of a complex sequence of layers of different opacities and shades aimed at imitating the basic components - dentin, enamel, and incisal translucency - of a natural central maxillary incisor (a).

source: Figs 22a, b The transition zone (red) is the area located between the shoulder of the implant and the mucosal margin.
vi: Hình 22a, b Vùng chuyển tiếp (đỏ) là vùng giữa vai implant và viền niêm mạc.

source: Figs 24a, b Vestibular (a) and occlusal (b) of the implant site after a ten-week period of uneventful healing, documenting that the first phase of post surgical soft-tissue maturation was completed.
vi: Hình 24a, b Vestibular (a) and occlusal (b) of the implant site after a ten-week period of uneventful healing, documenting that the first phase of post surgical soft-tissue maturation was completed.

source: Figs 24a, b Vestibular and palatal close-up views of the completed transocclusally screw-retained ceramo-metal implant-supported crown.
vi: Hình 24a, b Vestibular and palatal close-up views of the completed transocclusally screw-retained ceramo-metal implant-supported crown.

source: Figs 25a-d Four different close-up views of implant site 21, documenting the almost perfect condition of the peri-implant soft tissue from the points of view of health and esthetics.
vi: Hình 25a-d Four different close-up views of implant site 21, documenting the almost perfect condition of the peri-implant soft tissue from the points of view of health and esthetics.

source: Figs 26a, b A CO 2 laser technique was applied to create access to the underlying implant shoulder (a).
vi: Hình 26a, b A CO 2 laser technique was applied to create access to the underlying implant shoulder (a).

source: Figs 26a, b Labially pedicled flap, carefully tucked under in a labial direction.
vi: Hình 26a, b Labially pedicled flap, carefully tucked under in a labial direction.

source: Figs 28a, b Comparison of the labial views with (a) and without (b) the provisional RPD, indicating that sufficient soft-tissue height was present at site 11 to create a symmetrical soft-tissue contour at the position of the two central maxillary incisors.
vi: Hình 28a, b Comparison of the labial views with (a) and without (b) the provisional RPD, indicating that sufficient soft-tissue height was present at site 11 to create a symmetrical soft-tissue contour at the position of the two central maxillary incisors.

source: Figs 28a, b Right and left oblique views, confirming that, despite the slight difference in mesiodistal dimensions between the implant and natural tooth, an esthetically acceptable level of outcome had been reached.
vi: Hình 28a, b Right and left oblique views, confirming that, despite the slight difference in mesiodistal dimensions between the implant and natural tooth, an esthetically acceptable level of outcome had been reached.

source: Figs 29a, b Direct comparison between the centric occlusal position (a) and protrusive excursion of the mandible (b), demonstrating a harmonious occlusal pattern.
vi: Hình 29a, b Direct comparison between the centric occlusal position (a) and protrusive excursion of the mandible (b), demonstrating a harmonious occlusal pattern.

source: Figs 30a, b In this case, with the implant axis fully compatible with occlusal screw retention, it was decided to connect the provisional crown directly to the implant.
vi: Hình 30a, b In this case, with the implant axis fully compatible with occlusal screw retention, it was decided to connect the provisional crown directly to the implant.

source: Figs 31a, b After finishing and polishing, the temporary crown (a) produced at chairside was ready for insertion (b).
vi: Hình 31a, b After finishing and polishing, the temporary crown (a) produced at chairside was ready for insertion (b).

source: Figs 32a, b For demonstration purposes, a screw-retained provisional crown was fabricated in the dental laboratory, using the previously described RN synOcta temporary mesoabutment as its base.
vi: Hình 32a, b For demonstration purposes, a screw-retained provisional crown was fabricated in the dental laboratory, using the previously described RN synOcta temporary mesoabutment as its base.

source: Figs 32a, b The temporary crown (a) screwed onto an implant analog (b).
vi: Hình 32a, b The temporary crown (a) screwed onto an implant analog (b).

source: Figs 34a-c Vestibular (a) and occlusal (b) views of the master cast, showing a satisfactory three-dimensional implant position and peri-implant soft-tissue contours optimized on the working cast by the laboratory technician.
vi: Hình 34a-c Vestibular (a) and occlusal (b) views of the master cast, showing a satisfactory three-dimensional implant position and peri-implant soft-tissue contours optimized on the working cast by the laboratory technician.

source: Figs 36a, b Labial and occlusal close-up views of implant site 11 after attachment of the scanbody with its three small occlusal domes, permitting precise three-dimensional scanning of the implant shoulder position.
vi: Hình 36a, b Labial and occlusal close-up views of implant site 11 after attachment of the scanbody with its three small occlusal domes, permitting precise three-dimensional scanning of the implant shoulder position.

source: Figs 37a, b The computer-generated zirconium-dioxide custom abutment, to be connected to the synOcta 1.5 abutment (a) and displaying a slightly “whitish” appearance (b), required some preliminary modification to create optimal conditions for esthetic ceramic veneering.
vi: Hình 37a, b The computer-generated zirconium-dioxide custom abutment, to be connected to the synOcta 1.5 abutment (a) and displaying a slightly “whitish” appearance (b), required some preliminary modification to create optimal conditions for esthetic ceramic veneering.

source: Figs 38a, b Cervical portion of the crown to be shaped chairside.
vi: Hình 38a, b Cervical portion of the crown to be shaped chairside.

source: Figs 38a, b The original milled zirconium-dioxide custom abutment displayed a slightly “whitish” appearance (a).
vi: Hình 38a, b The original milled zirconium-dioxide custom abutment displayed a slightly “whitish” appearance (a).

source: Figs 3a, b Periapical radiographs at baseline.
vi: Hình 3a, b Periapical radiographs at baseline.

source: Figs 40a, b In the first step, the clinical crown volume, composed of a complex sequence of layers of different opacities and shades, imitating the basic components—dentine, enamel, and incisal translucency—of a natural maxillary incisor, was established (a).
vi: Hình 40a, b In the first step, the clinical crown volume, composed of a complex sequence of layers of different opacities and shades, imitating the basic components—dentine, enamel, and incisal translucency—of a natural maxillary incisor, was established (a).

source: Figs 41a, b Precise addition of more translucent ceramic to compensate for the contraction after the first sintering and to integrate additional optical features from the contralateral natural tooth (a).
vi: Hình 41a, b Precise addition of more translucent ceramic to compensate for the contraction after the first sintering and to integrate additional optical features from the contralateral natural tooth (a).

source: Figs 43a, b The labial surfaces of the implant-supported crown 11 and its contralateral natural tooth 21 were covered with a thin pellicle of gold spray to better highlight the basic features of tooth form and surface texture (a).
vi: Hình 43a, b The labial surfaces of the implant-supported crown 11 and its contralateral natural tooth 21 were covered with a thin pellicle of gold spray to better highlight the basic features of tooth form and surface texture (a).

source: Figs 45a, b The all-ceramic implant-supported crown 11 was inserted (a) and its esthetic integration verified (b).
vi: Hình 45a, b The all-ceramic implant-supported crown 11 was inserted (a) and its esthetic integration verified (b).

source: Figs 49a, b For direct comparison, an additional CARES titanium custom abutment (a) was produced for this same implant, serving as a base for a cemented Auro-Galvano ceramo-metal crown (b).
vi: Hình 49a, b For direct comparison, an additional CARES titanium custom abutment (a) was produced for this same implant, serving as a base for a cemented Auro-Galvano ceramo-metal crown (b).

source: Figs 4a, b At the moment of flap elevation, i.e. approximately two months after the extraction of the longitudinally fractured root, the prospective implant site 21 presented a localized, bone defect.
vi: Hình 4a, b At the moment of flap elevation, i.e. approximately two months after the extraction of the longitudinally fractured root, the prospective implant site 21 presented a localized, bone defect.

source: Figs 4a-c Forced orthodontic eruption is applied to enlarge soft-tissue and hard-tissue volume.
vi: Hình 4a-c Forced orthodontic eruption is applied to enlarge soft-tissue and hard-tissue volume.

source: Figs 50a, b The computer-generated titanium custom abutment, which had been previously sandblasted at the future abutment-to-crown interface, was connected directly to implant 11 and subsequently tightened to 35 Ncm (a).
vi: Hình 50a, b The computer-generated titanium custom abutment, which had been previously sandblasted at the future abutment-to-crown interface, was connected directly to implant 11 and subsequently tightened to 35 Ncm (a).

source: Figs 5a, b The labial view, immediately after the placement of a standard screw-type implant (a), confirmed the resulting two-wall dehiscence-type defect.
vi: Hình 5a, b The labial view, immediately after the placement of a standard screw-type implant (a), confirmed the resulting two-wall dehiscence-type defect.

source: Figs 5a-c A semilunar incision and subsequent rolling of a de-epithelialized pedicle flap in a buccal direction.
vi: Hình 5a-c A semilunar incision and subsequent rolling of a de-epithelialized pedicle flap in a buccal direction.

source: Figs 6a, b Comparative view of the vestibular aspect of the freshly inserted implant before (a) and after (b) adaptation of small autogenous bone chips collected in the close environment.
vi: Hình 6a, b Comparative view of the vestibular aspect of the freshly inserted implant before (a) and after (b) adaptation of small autogenous bone chips collected in the close environment.

source: Figs 6a-c A connective tissue graft is placed 6 weeks after implantation in order to improve the soft-tissue contours.
vi: Hình 6a-c A connective tissue graft is placed 6 weeks after implantation in order to improve the soft-tissue contours.

source: Figs 7a, b The cervical portion of the provisional crown is reshaped at chairside.
vi: Hình 7a, b The cervical portion of the provisional crown is reshaped at chairside.

source: Figs 7a, b The second step of the simultaneous GBR procedure was the application of a considerable amount of bone fillers (a) in order to recreate in slight excess the originally convex labial contour of the alveolar ridge.
vi: Hình 7a, b The second step of the simultaneous GBR procedure was the application of a considerable amount of bone fillers (a) in order to recreate in slight excess the originally convex labial contour of the alveolar ridge.

source: Figs 8a, b In order to allow for coronal repositioning and tension-free adaptation of the flap, several horizontal incisions of the periosteum had to be made.
vi: Hình 8a, b In order to allow for coronal repositioning and tension-free adaptation of the flap, several horizontal incisions of the periosteum had to be made.

source: Figs 9a-d An extraoral impression of the provisional crown is used to transfer the desired emergence profile to the impression cap.
vi: Hình 9a-d An extraoral impression of the provisional crown is used to transfer the desired emergence profile to the impression cap.

source: Figure 1 shows the clinical status 4 months after implant restoration in the area of the right central incisor.
vi: Hìnhure 1 shows the clinical status 4 months after implant restoration in the area of the right central incisor.

source: Figure 22 shows the actual implant position in relation to the comfort and danger zones in the mesiodistal direction.
vi: Hìnhure 22 shows the actual implant position in relation to the comfort and danger zones in the mesiodistal direction.

source: Figure 4 illustrates the coronoapical implant position in relation to the correct coronoapical implant position for this case.
vi: Hìnhure 4 illustrates the coronoapical implant position in relation to the correct coronoapical implant position for this case.

source: Figure 4c with the proposed future restoration in place explains the need for a bone-augmentation procedure to address the horizontal bone deficiencies.
vi: Hìnhure 4c with the proposed future restoration in place explains the need for a bone-augmentation procedure to address the horizontal bone deficiencies.

source: Figure 57 shows the crown’s cast-metal frame.
vi: Hìnhure 57 shows the crown’s cast-metal frame.

source: Figure 7 shows the pre-implantation treatment planning on the orthopantomograph (OPT).
vi: Hìnhure 7 shows the pre-implantation treatment planning on the orthopantomograph (OPT).

source: Figures 62 and 63 show the crown as it was ready for insertion (Figs 62, 63).
vi: Hìnhures 62 and 63 show the crown as it was ready for insertion (Hình 62, 63).

source: Fixed
vi: Cố định

source: Fixed partial denture - If teeth adjacent to the edentulous site are scheduled for full coverage restorations, this interim prosthesis can provide good esthetics and function while the site matures.
vi: Phục hình cố định - Nếu răng kế cận vùng mất răng được lên kế hoạch phục hình, phục hình tạm có thể cung cấp thẩm mỹ và chức năng khi vùng implant lành thương

source: Follow-up visits are recommended after 7, 14, and 21 days.
vi: Hẹn theo dõi sau 7, 14, and 21 ngày.

source: Following an additional 6-week healing period, the abutments were re-torqued to 35 Ncm and a final restoration fabricated and delivered in full occlusion.
vi: Thêm 6 tuần lành thương, cùi răng được vặn lại torque đến 35 Ncm và phục hình sau cùng được gắn chạm khớp đầy đủ

source: Following flap elevation, the surgical site was carefully analyzed.
vi: Sau khi lật vạt, vùng phẫu thuật được đánh giá cẩn thận

source: Following implant placement, a severe soft-tissue recession developed within a few months, exposing a significant portion of the implant surface (Fig 24).
vi: Following implant placement, a severe soft-tissue recession developed within a few months, exposing a significant portion of the implant surface (Hình 24).

source: Following removal of the short healing cap, a long healing cap was inserted to establish a soft-tissue “tunnel” from the implant shoulder to the soft-tissue surface (Fig 33).
vi: Sau khi tháo nắp lành thương ngắn, nắp lành thương dài được đặt vào để thiết lập "đường hầm" mô mềm từ vai implant đến bề mặt mô mềm (Hình 33).
